# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

import sys

script_name, working_hours, hourly_rate, bonuses = sys.argv
wage = (int(working_hours) * int(hourly_rate))+int(bonuses)
print(wage)
